brew "tree"
brew "wget"
brew "htop"
brew "nvtop"
brew "jq"
brew "watch"
brew "autoconf"
brew "automake"
brew "libtool"
brew "languagetool"
brew "vale"
brew "bash-completion@2"
brew "bitwarden-cli"

# Containers
brew "colima"
brew "docker"
# brew "podman"
# brew "k3d"

# Linux tools
brew "grep"
brew "zstd"
brew "coreutils"
brew "openssl"
brew "gnu-tar"
brew "curl"
brew "gawk"
brew "java"
brew "entr"
brew "tailscale"
brew "go"

# Dev Tools
brew "npm"
brew "yarn"
brew "node"
brew "rbenv"
brew "rbenv-gemset"
brew "python"
brew "ipython"
brew "just"

# Ops Tools
brew "awscli"
brew "minikube"

# Databases
brew "postgresql"

# ML
brew "whisper-cpp"
brew "espeak-ng"
brew "llama.cpp"

# tap "mostlygeek/llama-swap"
# brew "llama-swap"

cask_args appdir: "/Applications"
cask "rectangle"
cask "google-chrome"
cask "balenaetcher"
cask "caffeine"
cask "kdiff3"
cask "sqlworkbenchj"
cask "michaelvillar-timer"
cask "slack"
cask "marta"
cask "boop"
cask "shotcut"
cask "alacritty"
cask "chatgpt"
cask "pgadmin4"
cask "bitwarden"
cask "mater"
cask "wireshark-app"

# Documents and Editors
cask "basictex"
cask "visual-studio-code"
cask "zed"
cask "gimp"
brew "pandoc"
brew "gnuplot"
